{"abstract of title": "A written history of all the transactions related to the title for a specific tract of land. An abstract of title covers the period from the original source of title (often the original land grant from the United States government to an individual) to the present time and summarizes all subsequent documents that have been recorded against that tract.", "benjamin": "A buyer’s or seller’s agreement to enter into a contract and be bound by the terms of the offer.", "account termination fee": "A fee that may be charged if you pay in full and terminate your home equity line of credit during the first 5 years. Paying down to a zero balance does not count as termination. See also: prepayment penalty.", "additional principal payment": "A payment made by a borrower of more than the scheduled principal amount due in order to reduce the outstanding balance on the loan, to save on interest over the life of the loan and/or pay off the loan early.", "adjustable rate mortgage  arm ": "A mortgage in which your interest rate and monthly payments may change periodically during the life of the loan, based on the fluctuation of an index. Lenders may charge a lower interest rate for the initial period of the loan. Most ARMs have a rate cap that limits the amount the interest rate can change, both in an adjustment period and over the life of the loan. Also called a variable-rate mortgage.", "adjustment cap": "A limit to how much a variable interest rate can increase or decrease in a single adjustment period.", "adjustment date": "The date on which the interest rate changes for an adjustable-rate mortgage (ARM).", "adjustment period": "The period of time between adjustment dates for an adjustable-rate mortgage (ARM).", "affordability analysis": "A preliminary analysis of a borrower’s ability to afford the purchase of a home that takes into consideration factors such as income, liabilities and available funds, as well as the type of home loan, the likely taxes and insurance for the home and the estimated closing costs. See also: Prequalification", "amortization": "The gradual reduction in the principal amount owed on a debt. During the earlier years of the loan, most of each payment is applied toward the interest owed. During the final years of the loan, payment amounts are applied almost exclusively to the remaining principal.", "amortization table or schedule": "A timetable or schedule that gives you a breakdown of your monthly payments into principal and interest. You can use this schedule to figure out the amount of principal you’ll be repaying during your mortgage term.", "amortization term": "The amount of time required to amortize (pay off) the loan, expressed in months. For example, for a 15-year fixed-rate mortgage, the amortization term is 180 months.", "annual adjustment cap": "A limit on how much the variable interest rate on a loan can increase or decrease each year.", "annual percentage rate  apr ": "The annual cost of a loan to a borrower. Like an interest rate, the APR is expressed as a percentage. Unlike an interest rate, however, it includes other charges or fees (such as mortgage insurance, most closing costs, discounts points and loan origination fees) to reflect the total cost of the loan. The Federal Truth in Lending Act requires that every consumer loan agreement disclose the APR. Since all lenders must follow the same rules to ensure the accuracy of the APR, borrowers can use the APR as a good basis for comparing the costs of similar credit transactions.", "application fees": "Nonrefundable fees paid when you apply for your loan. These fees may include charges for items such as, for example, a credit profile or a property appraisal.", "appraisal or appraised value": "An informed estimate of the value of a property. When made in connection with an application for a loan secured by a home, a professional appraiser usually performs the appraisal.", "appraisal contingency": "A contingency in a sales contract that the property must appraise at a value that is equal to or greater than your offering price.", "appreciation": "An increase in the value of property over time. Important factors in a home’s appreciation are its location, condition and the selling price of similar homes in the area. Appreciation increases the amount of equity, which may also increase the amount you can borrow for a home equity line of credit.", "approved term  after approval ": "The number of months that it will take to pay off your loan. The approved term is used to determine the payment amount, repayment schedule and total interest paid over the life of the loan. See also: Term", "approved term  before approval ": "The number of months that it will take to pay off your loan. The approved term is used to determine the payment amount, repayment schedule and total interest paid over the life of the loan. See also: Term", "assessed value": "The value of a property, established by a public tax assessor. The assessed value is used to determine property taxes.", "assignment": "The method of transferring a right or contract, such as the terms of a loan, from one person to another.", "assumable loan": "A loan that may be transferred to someone else while maintaining the same terms. For example, if you have an assumable loan (not all loans are assumable) and you sell your home, you may be able to transfer that loan to the new owner with no change in the interest rate and repayment schedule, though you may need to pay a fee in order to do so.", "balance sheet": "A dated financial statement (in table form) that shows your assets, liabilities and net worth.", "balloon loan": "A loan that provides you with lower-than-usual monthly payments for a set period of time followed by a payment larger than usual at the end of your loan repayment period. While a balloon loan may lower your monthly payments it can also mean you make higher interest payments over the life of the loan.", "base rate": "An interest rate that is used as a benchmark, or index, for pricing variable-rate loans such as adjustable-rate mortgages, auto loans and credit cards.", "basis point": "An amount equal to 1/100th of a percentage point. For example, a fee calculated as 50 basis points of $200,000 would be 0.50% or $1,000.", "bond": "An interest-bearing certificate of debt with a maturity date. A real estate bond is a written obligation that is usually secured by a mortgage or a deed of trust.", "break even point": "The point at which total income equals total expenses. Also used in connection with decisions related to purchasing discount points on a mortgage. Calculating the break even point will identify how many months it will take to recoup the costs associated with paying for the discount point amount under consideration. In other words, if $3,600 is paid toward discount points to reduce the interest rate and the reduced rate would decrease the monthly mortgage payment by $100, it would take 3 years to break even on the choice to pay the discount point amount.", "bridge loan": "A type of mortgage financing between the termination of one loan and the start of another loan. For example, a bridge loan might be taken out by a borrower and secured by that borrower’s present home so that the closing on a new house can take place before the present home is sold.", "broker": "A third party who arranges funding or negotiates a contract between parties, but does not lend the money.", "broker fees": "Fees charged by a real estate broker or a mortgage broker for providing assistance in a real estate transaction.", "buydown": "The lump-sum prepayment of all or a portion of your mortgage interest by a lender or homebuilder in order to lower your monthly mortgage payment, typically for a period of 1-3 years. See also: Term", "call option": "A provision in a loan that gives the lender the right to accelerate the debt and require full payment of the loan immediately at the end of a specified period or for specified reason.", "cap": "A limit on how much a variable interest rate can increase. Many adjustable-rate mortgages have both annual (or semiannual) rate caps and lifetime caps. They limit the amount your payments can increase in an adjustment period and over the life of the loan. See: Interest rate cap", "cash available for closing": "Borrower funds that are available to cover down payment and closing costs. If lending guidelines require the borrower to have cash reserves at the time the loan closes or that the down payment come from specified sources, the borrower’s cash available for closing does not include cash reserves or money from those specified sources.", "cash to close": "The amount a homebuyer needs in cash at the closing of the loan. This typically, this includes down payment and closing costs.", "cash out refinance": "A refinance transaction in which the new loan amount exceeds the total of the principal balance of the existing first mortgage and any secondary mortgages or liens, together with closing costs and points for the new loan. This excess is usually given to the borrower in cash and can often be used for debt consolidation, home improvement or any other purpose.", "ceiling rate": "The maximum interest rate that can accrue on a variable rate loan or adjustable-rate mortgage (ARM).", "certificate of eligibility": "A document issued by the federal government certifying a veteran’s eligibility for a Department of Veterans Affairs (VA) loan.", "certificate of reasonable value  crv ": "A document issued by the Department of Veterans Affairs (VA) that establishes the maximum value and loan amount for a VA loan, based on an approved appraisal.", "certificate of title": "A statement provided by an abstract company, title company or attorney stating who holds title to real estate based on the public record.", "chain of title": "The history of all of the documents affecting title to a parcel of real property, starting with the earliest existing document and ending with the most recent.", "clear title": "Titles that are marketable and are free of liens or disputed legal questions as to ownership of the property.", "close": "The Close step is the date you will sign and execute your new loan documents.                                                                                                   Depending on the location of the property or type of transaction, the three business days right of rescission period may apply before your funds are available to you.                                                                                                                                                                                                          The three business days right of rescission period states that in certain real estate secured transactions that involve the refinance of a primary residence, the Truth in Lending Act allows applicants 3 business days to cancel the transaction and prohibits lenders from disbursing proceeds until after the rescission period has lapsed.                                                                                                          ", "closed": "A status of closed indicates that no further action is required on this item.", "closing": "The time and place, at which all documents for your loan are signed, dated, and notarized. See also: settlement", "closing costs": "Closing costs, also known as settlement costs, are the costs incurred when obtaining your loan. For new purchases, these costs also include ownership transfer of any collateral property from the seller to you. Costs may include and are not limited to: attorney's fees, preparation and title search fees, discount points, appraisal fees, title insurance, and credit report charges. They are typically about 3% of your loan amount, and are often paid at closing or just before your loan closes.                                                                                                                          Funds often needed to close a loan, such as homeowners insurance, property taxes, and escrow impound account funds, aren't included in closing costs and are considered separate. You should be prepared to pay these costs before your loan closes.", "closing date": "The date you will sign your new loan documents.", "closing disclosure  cd ": "A closing document which provides key information such as interest rate, monthly payments, and costs to close the loan. Consumers are required to receive this form no later than 3 business days before they close on the loan.", "closing statement": "An accounting of funds given to both buyer and seller before real estate is sold.", "co borrower": "An additional person who assumes equal responsibility for repayment of a loan and is fully obligated under the terms of the loan. This person also has equal rights to the proceeds of the loan.", "cobra  consolidated omnibus budget reconciliation act ": "Requires employers with more than 20 employees to make group health care coverage available for 18 months, at the employee’s expense, to employees who leave the employer for any reason other than gross misconduct.", "coinsurance": "A sharing of insurance risk between the insurer and the insured. Coinsurance depends on the relationship between the amount of the policy and a specified percentage of the actual value of the property insured at the time of the loss.", "collateral": "An asset, such as a car or a home, used for securing the repayment of a loan. The borrower risks losing the asset if the loan is not repaid.", "collection": "The efforts used to bring a delinquent loan current and, if necessary, to file legal papers and notices to proceed with foreclosure.", "combination loan": "A combination loan pairs a conforming first mortgage with a home equity second mortgage for up to 80% of the property's value in a single application with 1 down payment. Combination loans may help you avoid the higher rates of a jumbo first mortgage. Combination loans are made up of 3 parts: 70% first mortgage, 10% home equity second mortgage and 20% down payment.", "combined liens": "The outstanding balance of all mortgages held on a property. Used to determine the total available equity when considering the appraised value of the property less total combined or outstanding liens.", "combined loan to value ratio  cltv ": "The ratio between the unpaid principal amount of your first mortgage, plus your credit limit if you have a home equity line of credit, and the appraised value of your home. Expressed as a percentage.", "commitment letter": "A letter agreement in which a lender sets out the terms on which it is prepared to lend money to the borrower. It is generally accompanied by a term sheet which sets out the terms of the loan.", "comparables  comps ": "Properties similar to the property under consideration for a mortgage that have approximately the same size, location and amenities and have recently been sold. Comparables help an appraiser determine the fair market value of a property.", "compound interest": "Interest paid on the principal balance and on the accrued and unpaid interest.", "conforming loan": "A mortgage loan that has the standard features as defined by (and is eligible for sale to) Fannie Mae and Freddie Mac.", "construction loan": "A short-term interim loan for financing the cost of home construction. The lender makes payments to the builder at periodic intervals as the work progresses.", "contingency": "A specified condition in a sales contract that must be satisfied before the home sale can occur. When buying a home, the 2 most common contingencies are that the house must pass inspection and that the borrower must be approved for a loan.", "contractual payment first mortgage": "For a mortgage, the contractual payment is the required monthly payment amount for your home loan as described and determined by your loan contract. The contractual payment may include principal and interest due and may include a portion of funds due to cover homeowners insurance, mortgage insurance (if applicable), and property taxes associated with your home.", "here s how it works": "Principal + interest + mortgage insurance (if applicable) + homeowners insurance and tax (if applicable) = full contractual payment.", "contractual payment home equity line of credit": "For a home equity line of credit, the contractual payment is the amount owed each month, which may fluctuate based on usage of the line and the terms of your loan agreement. At times, your Contractual Payment may consist of interest only or interest and principal payments.", "conventional loan": "A home loan that is not insured or guaranteed by the federal government. A conventional loan can be for conforming or non-conforming loan amounts.", "convertibility clause": "A provision in some adjustable-rate mortgages (ARMs) that allows the borrower to change the ARM to a fixed-rate loan at specified times during the life of the loan.", "convertible arm": "An adjustable-rate mortgage (ARM) that can be converted to a fixed-rate loan under specified conditions.", "convey": "To transfer or deliver title to property from one to another by deed or contract. When an item becomes a part of the transfer of title, it is conveyed with the property.", "co signer": "A second person who signs your loan and assumes equal responsibility for payment of the loan but receives no benefit from the loan proceeds.", "cost of funds index  cofi ": "An index that is used to determine interest rate changes for certain adjustable-rate mortgages (ARMs). It represents the weighted-average cost of savings, borrowings and advances of the 11th District members of the Federal Home Loan Bank of San Francisco. See also: Adjustable-rate mortgage (ARM)", "covenant": "A promise in a mortgage or deed that requires or prevents certain uses of the property that, if violated, may result in loss or foreclosure of the property.", "credit bureau": "An organization that gathers, records, updates and stores financial and public records of individuals who have been granted credit and provides this information to lenders and other authorized users for a fee. The 3 major credit bureaus are Equifax, Experian and TransUnion and you are legally entitled to receive 1 free report each year from each of these agencies.", "credit limit": "The maximum amount you can borrow under a line of credit.", "credit monitoring service": "A service that offers the benefit of early detection of unauthorized activity in order to limit the amount of financial damage that a person may suffer at the hands of an identity thief.", "credit report": "A record of an individual’s debts and payment habits. It helps a lender determine whether or not a potential borrower is a good business risk. The 3 major credit bureaus that provide credit reports are Equifax, Experian and TransUnion and you are legally entitled to receive 1 free report each year from each of these agencies. Learn how to read a credit report", "credit risk": "The likelihood that a borrower will pay their obligations as agreed. Borrowers who pay as agreed pose less credit risk to lenders.", "credit score": "A number that rates the quality of an individual’s credit. The number helps predict the relative likelihood that a person will repay a credit obligation, such as a mortgage loan. In general, the higher your credit score, the more likely you are to be approved for and to pay a lower interest rate on a loan. See how Bank of America credit card holders can obtain a free monthly score", "creditor": "A person or business from whom you borrow or to whom you owe money.", "creditworthiness": "The likely ability of a borrower to repay debt.", "cumulative interest": "Total interest accrued.", "curtailment": "A payment that reduces the principal balance of a loan.", "debt consolidation": "A single loan to pay off multiple debts, usually over a longer term. This is a popular use for a home equity line of credit.", "debt to income ratio": "Your total monthly debt payments (for example: loans, credit cards and court-ordered payments) divided by your gross monthly income before taxes and expressed as a percentage. Federal Housing Administration (FHA) guidelines layer in early 2017 recommend that your monthly mortgage payment should be no greater than 31% of your monthly income before taxes and your total monthly debt should be no greater than 43% of your monthly income before taxes.", "deed  warranty or quit claim ": "A document that legally transfers ownership of real estate from a seller to a buyer and delivered to the buyer at closing. Before making a loan, a lender will usually require a title search or a title report to make sure the borrower legally owns the real estate tthat is being used to secure the loan.", "deed of trust": "The document used in some states instead of a mortgage; title is vested in a trustee to secure repayment of the loan.", "default": "Failure to make mortgage payments on time or to meet other terms of a loan. Default can lead to foreclosure.", "delinquency": "Failure to make payments on time.", "discount points": "See: Points", "down payment": "The amount of cash you pay toward the purchase of your home to make up the difference between the purchase price and your mortgage loan. Down payments often range between 5% and 20% of the sales price depending on many factors, including your loan, your lender and your credit history. How much of a down payment should you make?", "draw": "The process of obtaining an advance against your available line of credit.", "draw period": "The period during which a borrower can obtain advances (also called draws) from an available line of credit. At the end of the draw period, borrowers may be able to renew the credit line or be required to pay the outstanding balance in full or in monthly installments.", "due on sale provision": "A provision in a mortgage home loan that allows the lender to demand repayment in full if the borrower sells the property that serves as security for the loan.", "earnest money": "A deposit made toward a down payment as a sign of good faith. The deposit is typically made when a purchase agreement is signed.", "encumbrance": "Any lien or liability attached to a property that affects or limits the title to that property, for example unpaid taxes, mortgages and leases.", "equal credit opportunity act  ecoa ": "A federal law that requires lenders and other creditors to make credit available without discrimination based on race, color, religion, national origin, age, sex, marital status or receipt of income from public assistance programs. Learn more about the ECOA layer", "equity": "The difference between the fair market value (appraised value) of your home and your outstanding mortgage balances and other liens.", "escrow": "Funds deposited with a third party, to be held until a specific date is reached and/or a specific condition is met.", "escrow account": "An escrow account is created at no cost to you to hold money to pay your homeowners insurance and property taxes on your behalf. We obtain information to determine the yearly insurance and tax amounts due on the property and include those amounts in your contractual payments to eliminate a large one-time expense to you. Escrow funds received as part of contractual payments are placed into an escrow account. When an insurance or property tax bill is received, escrow funds collected over time in the escrow account are used to pay these bills.                                                                                                                                                                                                                                            Escrow accounts can also be referred to as Impound Accounts.", "escrow impound account": "Typically refers to an account set up by a lender in which funds to pay for real estate taxes and homeowners insurance are deposited as part of the borrower's monthly mortgage payment, then disbursed as tax and insurance payments come due.", "escrow analysis": "An escrow analysis is performed periodically (generally once per year or more often due to specific events, such as a loan modification) and compares the amounts collected and paid into the escrow account with the actual charges paid out of the escrow account for taxes and insurance billed.                                                                                                                                                                                                                                      The analysis also projects what will be paid out of escrow over the next year and calculates the escrow payment amounts that will be needed to fund your escrow account for the upcoming year.", "escrow overage": "An escrow overage will occur when your escrow account balance exceeds the required minimum balance for the account. These escrow overages typically happen when there is a decrease in your property taxes or insurance premiums. When this happens, you may receive an escrow overage refund check or funds may be applied towards a future escrow balance.", "escrow shortage": "An escrow shortage will occur when the balance in your escrow account drops below the required minimum balance. These escrow shortages typically happen when there is an increase in your property taxes or insurance premiums. When this happens, you may need to make up the shortage through an increase in your contractual payment or you may elect to make a separate payment into the escrow account.", "extra payment payment overage": "When you pay more than your contractual payment, the additional amount that is paid, can either pay your next month's contractual payment or reduce the unpaid principal balance of your mortgage after satisfying any other amounts that are due (for example, outstanding fees, etc.). This may reduce the interest assessed in the future.", "fair credit reporting act  fcra ": "Law passed by Congress to give borrowers certain rights when dealing with consumer reporting agencies, or credit bureaus. All credit bureaus are required to provide accurate credit histories to authorized businesses for use in evaluating applications for insurance, employment, credit or loans. Learn more about the FCRA layer", "fair market value": "The likely selling price of a home. The fair market value is usually determined by an appraisal.", "fannie mae": "Federal National Mortgage Association, a government-sponsored enterprise that buys and securitizes mortgages for resale in the secondary market. Visit the Fannie Mae website layer", "federal housing administration  fha ": "An agency of the Department of Housing and Urban Development. The FHA provides mortgage insurance for certain residential mortgages. It also sets standards for underwriting these mortgages and for construction of homes secured by these mortgages. Visit the FHA website layer", "fee simple": "Clear and absolute ownership of a piece of property. The fee simple owner of a property has the right to use the land in any way desired, for example: build on it, sell it or lease it.", "fha home loan": "A mortgage that is insured by the Federal Housing Administration (FHA). Also known as a government loan. FHA mortgage insurance protects the lender (not the borrower) if a borrower defaults on the FHA loan. This insurance enables a lender to provide loan options and benefits often not available through conventional financing.", "fico ": "An acronym for Fair Isaac Corporation, which develops the mathematical formulas used to produce credit scores for assessing credit risk. FICO scores fall between a low of 300 and a high of 850. The higher the FICO score, the lower credit risk a consumer presents. Learn more about FICO scores", "finance charge": "The cost of consumer credit expressed as a dollar amount. It includes the amount of interest you will pay during the terms of the loan, origination points and certain other items. Some closing costs are not treated as finance charges.", "first mortgage": "A mortgage that is the senior lien against a property.", "fixed rate mortgage": "A home loan with a predetermined fixed interest rate for the entire term of the loan.", "fixed rate option  fixed rate loan option ": "An option available on certain home equity lines of credit allowing borrowers to fix the payments and interest rate on a portion of their outstanding principal balance for a specific term. Customers may be charged a fee for this privilege.", "floating rate": "A loan rate for which the lender has not \"locked\" or committed to lend at a particular interest rate. The floating interest rate and any discount points are not guaranteed. Your actual interest rate and discount points will be based on the market price available for your loan product at the time your interest rate is locked.", "flood certification": "A determination by a reputable source about whether property is located within a special flood hazard zone.", "flood insurance": "Insurance that protects against loss due to floods. When available, this type of insurance is required by law when a property is located within a special flood hazard zone.", "forbearance": "A period during which your monthly loan payments are temporarily suspended or reduced. You may qualify for forbearance if you are willing but unable to make loan payments due to certain types of financial hardships. During forbearance, principal payments are postponed but interest continues to accrue.", "foreclosure": "A legal procedure in which property securing a defaulted loan is sold by the lender in order to repay a borrower’s loan. The amount paid by a buyer at the foreclosure may not be enough to fully repay the loan and the borrower may continue to owe the lender the difference.", "forfeiture": "The loss of money, property, rights or privileges due to a breach of legal obligation.", "form 1098": "A legal tax form that reports the amount of interest and points paid during the previous year.", "freddie mac": "A government-sponsored enterprise that buys and securitizes mortgages for resale in the secondary market. Visit the Freddie Mac website layer", "funding date": "The date on which the proceeds from a loan are available to or disbursed for the benefit of the borrowers.", "good faith estimate  gfe ": "An itemized, detailed list of certain estimated costs associated with a home loan that the lender is required to provide to the borrower within 3 business days of the application.", "government loan": "A loan that is insured by the Federal Housing Administration (FHA), guaranteed by the Department of Veterans Affairs (VA) or guaranteed by the Rural Housing Service (RHS). The insurance protects the lender (not the borrower) if a borrower defaults on the loan. This insurance enables a lender to provide loan options and benefits often not available through conventional financing.", "government national mortgage association  gnma or ginnie mae ": "A government-owned corporation within the U.S. Department of Housing and Urban Development (HUD). Created by Congress on September 1, 1968, GNMA assumed responsibility for the special assistance loan programs formerly administered by Fannie Mae. Visit the Ginnie Mae website layer", "hazard insurance": "See: Homeowners insurance", "home equity line of credit  heloc ": "A line of credit secured by the borrower's residence. The typical HELOC term is 30 years: a 10-year draw period followed by a 20-year repayment period. A HELOC is often used for home improvements, debt consolidation or other major expenses. In most cases, you can withdraw funds up to your available credit limit for the first 10 years (your draw period) using convenience checks, debit cards or money transfer via Online Banking. Learn more about HELOCs", "homeowners insurance": "Insurance to protect your home against damage from fire, hurricanes and other catastrophes. Usually, homeowners insurance also covers you against theft and vandalism, as well as personal liability in case someone is hurt or injured on your property. A lender will likely require you to name it as a payee under the insurance if you need to make a claim. Also called hazard insurance.", "hud": "An acronym for the U.S. Department of Housing and Urban Development. HUD is a government agency responsible for the implementation and administration of housing and urban development programs. Among other things, HUD administers the Federal Housing Administration, enforces RESPA regulations and oversees Fannie Mae and Freddie Mac. Visit the HUD website layer", "impound account": "See: escrow impound account", "impounding": "The collection and placement of monies by a lender into an account in order to pay the borrower’s property taxes and insurance premiums when they become due.", "income property": "Real estate developed or improved to produce income.", "index": "When used in a mortgage note or credit agreement, a financial index is the measurement used to decide how much the annual percentage rate will change at the beginning of each adjustment period. Generally, the index plus or minus margin equals the new rate that will be charged, subject to any caps. Lenders use various financial index rates: Secured Overnight Financing Rate[(SOFR) and Treasury-Indexed ARMs (T-Bills)]", "inflation rate": "The increase in price of consumer goods, usually expressed as a percentage over a specific period of time.", "initial advance": "The process of obtaining an advance against available credit under your line of credit.", "initial advance at closing": "You have chosen our funds transfer option to reduce your interest rate. Please verify that the account information is correct. If you maintain at least this $25,000 balance for the first three consecutive billing cycles the account is open, you will receive .25% off your approved rate for the life of the line.", "initial advance of  25 000 or more": "The initial advance of $25,000 or more discount applies for drawing an initial advance of $25,000 or more, and maintaining at least that minimum balance for the first 3 full consecutive billing cycles.", "initial draw amount": "The proceeds of the home equity line of credit or construction loan up to an amount the borrower is allowed to request at closing.", "initial rate": "The starting interest rate. Some people call this the “teaser rate,” because it gives you low interest and low monthly payments at the beginning, but may adjust up at the next adjustment period (it will usually adjust even if the index doesn’t go up, since it’s lower than index plus margin for the initial period).", "inquiry": "A request for your credit report, made by you or a company considering you for an offer of credit.", "installment loan": "A loan that is repaid in equal payments, known as installments.", "insurance": "A contract that provides compensation for specific losses in exchange for a periodic payment. An individual contract is known as an insurance policy, and the periodic payment is known as an insurance premium.", "insurance binder": "A document that states that insurance is temporarily in effect. Because the coverage will expire by a specified date, a permanent policy must be obtained before the expiration date.", "insured mortgage": "A mortgage that is protected by an insurer in case of default. The insurance protects the lender (not the borrower) if a borrower defaults on the loan.", "interest accrual rate": "The percentage rate at which interest accrues on the mortgage. In most cases, it is also the rate used to calculate the monthly payments.", "interest only loan": "A loan for which you pay only the interest due for a portion of the loan term. This lowers your periodic payment but does not decrease your principal balance on the loan. Making interest-only payments will result in larger payments being due at the end of the interest-only payment period. See also: Balloon loan", "interest rate": "The annual cost of a loan to a borrower, usually expressed as a percentage. The interest rate does not include fees charged for the loan. See also: Annual percentage rate (APR)", "interest rate buydown": "See: Buydown", "interest rate cap": "A limit on how much the variable interest rate can increase at any one time. Many home loans have both annual (or semiannual) caps and lifetime caps, which limit the amount your payments can increase in an adjustment period and over the life of the loan. Many caps allow a rate increase of 2-5% over the starting interest rate in an adjustment period (for example, a starting rate of 5% could increase to 7% or, depending on the loan guidelines, to as much as 10%). A lender’s lifetime interest rate cap is typically 6% over the life of the loan.", "investment property": "Property that is purchased to generate rental income, or to be sold once it has appreciated in value.", "judgment": "A decree by a court of law that one person is indebted to another for a specified amount. In some states, the court may place a lien against the debtor’s real property as collateral for payment of the judgment to the creditor.", "jumbo loan": "Also known as a nonconforming loan. The amount of the loan exceeds standards that would make it eligible for sale to Fannie Mae and Freddie Mac. Certain geographical areas have temporary conforming loan limits higher than typical conforming limits. Lenders may charge additional fees and place certain restrictions due to the large loan amounts. Learn more about jumbo loans", "liabilities": "A person’s debts or financial obligations. Liabilities include long-term and short-term debt, as well as potential losses from legal claims.", "liability insurance": "See: Homeowners insurance", "lien": "The legal claim of a creditor on a borrower’s property, to be used as security for a debt.", "lien holder": "An individual or entity that has placed a lien on real property.", "lifetime adjustment cap": "A limit on how much the variable interest rate can increase during the term of a loan.", "line of credit": "An agreement by a lender to extend credit up to a maximum amount for a specified time. In a home equity line of credit, the line of credit is secured by the borrower’s home. Learn more about a home equity line of credit", "loan commitment": "A formal notification from a lender stating that the borrower’s loan has been conditionally approved and specifying the terms under which the lender agrees to make the loan.", "loan estimate  le ": "Disclosure to help consumers understand the key loan terms and estimated costs of a mortgage before they make a complete application. After a consumer submits 6 key elements: name, income, social security number, property address, estimated property value and desired loan amount, the lender is required to provide this form. All lenders are required to use the same standard loan estimate form to make it easier for consumers to compare and shop for a mortgage.", "loan modification": "Changes to one or more of the terms of a loan.", "loan origination": "The process by which a mortgage lender makes a home loan and records a mortgage against the borrower’s real property as security for repayment of the loan.", "loan term": "See: Term", "loan to value ratio  ltv ": "The ratio between the unpaid principal amount of your loan, or your credit limit in the case of a line of credit, and the appraised value of your collateral. Expressed as a percentage. For example, if you have an $80,000 first mortgage on a property with an appraised value of $100,000, the LTV is 80% ($80,000 / $100,000 = 80%).", "lock period": "The amount of time prior to closing that you can secure an interest rate for your loan. Lock periods typically range from 30 days to more than 90 days. Generally, the longer the lock period, the more you pay in points or interest.", "manufactured housing": "A structure that has been partially or entirely constructed at another location and moved onto the property (on a permanent foundation). A manufactured home may or may not be a mobile home.", "margin": "The number of percentage points the lender adds to or subtracts from the index rate to determine the interest rate adjustments. The margin is constant throughout the life of the mortgage and is specified in the promissory note.", "maturity date": "The day on which the outstanding principal, interest and fees on a loan must all be repaid.", "miscellaneous payment": "Miscellaneous payments can be submitted by you through MortgagePay within Online Banking. Any Miscellaneous Payment made using MortgagePay will be applied to the account in accordance with the terms and conditions of your loan which may include application to fees, principal, and/or other categories, such as unapplied funds if less than the current contractual payment due.", "mobile home": "A type of residence that’s built upon a wheeled chassis and can be transported from site to site.", "modular home": "A factory-built home that’s erected on-site, with the appearance and characteristics of a site-built residence.", "mortgage": "A legal document giving a lender a lien on real estate to secure repayment of a loan. Mortgage loans generally run from 10 to 30 years, after which the loan is required to be paid off. Also called deed of trust and/or security deed.", "mortgage insurance": "For conventional loans, insurance that protects the lender if you default on your loan. If your down payment is less than 20%, most lenders will require you to pay mortgage insurance. Also called private mortgage insurance (PMI).", "mortgage points": "See: Points", "mortgage type": "Generally, there are three basic mortgage programs: Federal Housing Administration (FHA) loans, Department of Veterans Affairs (VA) loans and conventional mortgage loans. VA loans are only offered to qualifying veterans and surviving spouses, while FHA loans are available to all qualifying borrowers. Both VA and FHA loans are guaranteed/insured by the federal government. This insurance protects the lender (not the borrower) should the borrower default and the lender sustains a loss. Conventional loans are available to all qualifying borrowers and are not insured or guaranteed by the federal government.", "multi family residence  2 to 4 units ": "A residential property with 2 to 4 individual housing units (duplex, triplex or quadplex).", "negative amortization": "The result when monthly payments don’t cover all the interest due on the loan. The unpaid interest is added to the unpaid balance, which means the homebuyer will owe increasingly more than the original amount of the loan.", "new line amount": "The sum of the existing credit line and the amount of additional credit requested.", "no closing cost loan": "A loan in which the borrower is not required to pay cash out-of-pocket at closing for the normal closing costs. The lender typically includes the closing costs in the principal balance or charges a higher interest rate than for a loan with closing costs to cover the advance of closing costs.", "nonconforming loan": "See: Jumbo loan", "nonowner occupied": "Properties in which the owner does not live.", "note": "A written agreement in which the signer promises to pay to a named person or company a specific sum of money at a specified date or on demand.", "note rate": "The interest rate stated in a mortgage note.", "notice of default": "A formal written notice to a borrower that a default has occurred and that legal action may be taken.", "option arm": "A type of adjustable-rate mortgage (ARM) that offers the borrower a choice of 4 monthly payment options to help provide financial flexibility to manage payments in rising rate markets and take advantage of falling interest rates.", "origination": "The date that the proceeds of a loan are disbursed.", "origination date": "The date on which a loan is funded or disbursed.", "origination fee": "A fee imposed by a lender to cover certain processing expenses in connection with making a mortgage loan. Usually a percentage of the amount loaned (often 1%). The origination fee is stated in the form of points. See also: Points", "owner financing": "A property purchase transaction in which the property seller provides all or part of the financing.", "owner occupied": "A property that the owner occupies as a principal residence.", "payment cap": "A limit on how much a monthly payment can increase at any one time. Some adjustable-rate mortgages have payment caps in addition to annual (or semi-annual) interest rate caps and lifetime interest rate caps. Payment caps don’t limit the amount of interest charged and may cause negative amortization. See also: Interest rate cap", "payment change date": "The date when a new monthly payment amount takes effect on an adjustable-rate mortgage (ARM). Generally, the payment change date occurs in the month immediately after the interest rate adjustment date. The borrower is notified 30 days before the new rate and payment take effect.", "payoff": "Payment of the outstanding balance of a loan in full. Also, the amount required to pay the outstanding balance in full.", "per diem interest": "The amount of interest that accrues daily on a loan. This is calculated by multiplying the outstanding loan balance by the annual rate of interest, then dividing the result by 365.", "piti": "An acronym for principal, interest, taxes and insurance. Also referred to as the monthly housing expense.", "points": "An amount paid to the lender, typically at closing, to lower (or buy down) the interest rate. One discount point equals one percentage point of the loan amount. For example, 2 points on a $100,000 mortgage would cost $2,000. Negative points indicate the amount to be credited at closing to reduce closing costs. Also called discount points or mortgage points.", "preapproval": "A lender’s conditional agreement to lend a specific amount of money to a homebuyer under a specified set of terms.", "prearranged refinancing agreement": "A formal or informal arrangement between a lender and a borrower where the lender agrees to offer special terms (such as a reduction in the rate or closing costs) for a future refinancing as an inducement for the borrower to enter into the original mortgage transaction.", "preforeclosure sale": "See: Short sale", "prepaid expenses": "The expenses that are usually paid in advance, such as escrows for taxes and insurance (which are paid at closing).", "prepaid interest": "Interest collected at closing of a first mortgage, covering the period from the date of disbursement to the start of the next payment period.", "prepayment": "An amount paid to reduce the principal balance of a loan before the principal is due.", "prepayment penalty": "A prepayment penalty is a fee that some lenders charge if you pay off all or part of your mortgage early. If you have a prepayment penalty, you would have agreed to this when you closed on your home.", "prequalification": "The process of providing financial and other information (such as employment history and proposed collateral) by a prospective borrower in order for the lender to preliminarily estimate how much the borrower may obtain for the purchase of a home. A prequalification is not a commitment to lend.", "prime rate": "The interest rate that banks charge their best customers when lending them money. The U.S. Prime Rate, as published daily by The Wall Street Journal, is based on a survey of the prime rates of the 10 largest banks in the United States. The U.S. Prime Rate is used by some financial institutions to calculate variable interest rates for credit cards. Changes in the U.S. Prime Rate influence changes in other rates, including mortgage interest rates.", "principal   interest": "The principal is the amount of money borrowed on a loan. The interest is the charge paid for borrowing money. Principal and interest account for the majority of your mortgage payment, which may also include escrow payments for property taxes, homeowners insurance, mortgage insurance and any other costs that are paid monthly, or fees that may come due.", "principal balance": "The unpaid portion of the loan amount. The principal balance does not include interest or any other charges.", "principal payment": "Portion of your monthly payment that reduces the principal balance of a home loan. This term also refers to prepayments you make to the principal balance.", "private mortgage insurance  pmi ": "See: Mortgage insurance", "processing fee": "A fee charged to cover the administrative costs of processing a loan request.", "promissory note": "A written promise to repay a specified amount over a specified period of time.", "purchase agreement": "A written contract signed by the buyer and seller stating the terms and conditions under which a property will be sold.", "qualifying ratios": "Calculations that are used to determine whether a borrower can qualify for a mortgage. They consist of 2 separate calculations: a housing expense as a percent of income and total debt obligations as a percent of income.", "rate": "The amount of interest on a loan, expressed as a percentage.", "rate cap": "See: Interest rate cap", "rate lock": "A commitment issued by a lender to a borrower guaranteeing a specific interest rate for a specified period of time. Rate lock periods are for a fixed number of days, and rate lock expiration occurs when that period has passed, subjecting the interest rate on the loan to market fluctuations since the date of the initial rate lock. When a rate lock expires, you will need to contact your lending specialist to establish a new rate lock prior to closing your loan.", "rate lock expiration": "A commitment issued by a lender to a borrower guaranteeing a specific interest rate for a specified period of time. Rate lock periods are for a fixed number of days, and rate lock expiration occurs when that period has passed, subjecting the interest rate on the loan to market fluctuations since the date of the initial rate lock. When a rate lock expires, you will need to contact your lending specialist to establish a new rate lock prior to closing your loan.", "rate reduction option": "A provision in a fixed-rate mortgage that gives the borrower the option to reduce the interest rate at a later date without having to refinance. Exercising a rate reduction option typically does not require requalifying for the loan.", "real estate settlement procedures act  respa ": "A consumer protection law that, among other things, requires advance disclosure of settlement costs to home buyers and sellers, prohibits certain types of referral and other fees, sets rules for escrow accounts and requires notice to borrowers when servicing of a home loan is transferred.", "reamortize": "To take the remaining balance of a mortgage loan and establish a new period of amortization after which the principal balance will be zero. Typically used after the end of the term of an interest-only loan.", "recorder": "A charge for a public official (typically a Registrar of Deeds or County Clerk) noting in the public record the terms of a legal document affecting title to real property such as a deed, a security instrument, a satisfaction of mortgage or an extension of mortgage.", "recording": "A charge for a public official (typically a Registrar of Deeds or County Clerk) noting in the public record the terms of a legal document affecting title to real property such as a deed, a security instrument, a satisfaction of mortgage or an extension of mortgage.", "recording fee": "A charge for a public official (typically a Registrar of Deeds or County Clerk) noting in the public record the terms of a legal document affecting title to real property such as a deed, a security instrument, a satisfaction of mortgage or an extension of mortgage.", "reduced documentation": "A method used to determine income when qualifying a borrower for a loan. Borrower(s) provide their income, however no verification documentation is typically required.", "refinance": "Paying off your existing loan with the proceeds from a new loan, generally using the same property as collateral, in order to take advantage of lower monthly payments, lower interest rates or save on financing costs.", "rehabilitation loan": "A first mortgage that enables borrowers to purchase or refinance and rehabilitate homes. With this mortgage product, borrowers can qualify for loan amounts based on the as-completed value of the property, up to the maximum loan limits.", "repayment period": "The time you have to fully repay your outstanding balance, according to your payment terms. In a home equity line of credit, for example, the repayment period (typically 20 years) is the loan term that follows the draw period (typically 10 years).", "rescission": "The cancellation of a contract. In certain real estate-secured transactions that involve the refinance of a primary residence, applicants have 3 business days to cancel the transaction.", "reserves": "The amount of savings, separate from the down payment, that a homebuyer sets aside in case of unforeseen events or emergencies. During the loan approval process, many lenders require reserves (typically the equivalent of 2 monthly mortgage payments) to be verified.", "right of first refusal": "A provision in an agreement that requires the owner of a property to give another party the first opportunity to purchase or lease the property before he or she offers it for sale or lease to others.", "rural housing loan": "A loan offered by the Rural Housing Service (RHS), an agency within the Department of Agriculture. The RHS provides financing to farmers and other qualified borrowers buying property in rural areas who are unable to obtain loans elsewhere. Funds are borrowed from the U.S. Treasury. See also: Government loan", "rural housing service  rhs ": "A loan offered by the Rural Housing Service (RHS), an agency within the Department of Agriculture. The RHS provides financing to farmers and other qualified borrowers buying property in rural areas who are unable to obtain loans elsewhere. Funds are borrowed from the U.S. Treasury. See also: Government loan", "second home": "A property occupied part-time by a person in addition to his or her primary residence.", "secured loans": "Loans for which the borrower gives the lender a lien on property such as an automobile, boat, other personal property or real estate that will serve as collateral for the loan.", "security": "The property that will be pledged as collateral for a loan. If the borrower defaults, the lender can sell the collateral to satisfy the debt.", "settlement": "The completion of a property’s sale or purchase, or the completion of all steps necessary to receive the proceeds of (and create an obligation to repay) a loan. See also: Closing", "settlement agent": "A person or entity that conducts the settlement to transfer title of the property and to close on the mortgage loan. May be an attorney, a title insurer, a title agent or an escrow agent.", "settlement costs": "See: Closing costs", "short sale": "A commonly used alternative to a foreclosure. If a homeowner can no longer afford to make mortgage payments and their home is worth less than they owe, a short sale allows them to sell the home to pay off the mortgage. In a short sale, the lender agrees to accept an amount less than is actually owed on the loan, based on a showing of financial hardship.", "single family residence": "A detached individual housing unit. The property shares no common ground with neighboring properties and shares no wall or roof, but can be part of a planned unit development (PUD).", "sofr": "Secured Overnight Financing Rate; SOFR is a broad measure of the cost of borrowing cash overnight collateralized by U.S. Treasury securities.", "start rate": "The starting interest rate for an adjustable-rate mortgage (ARM) loan or variable-rate home equity line of credit. Also known as an initial rate or intro rate. It provides lower interest and lower monthly payments at the beginning but may adjust at the next adjustment period.", "subordinate financing": "Any mortgage or other lien that has a priority lower than that of the first mortgage. The subordinate loan has a claim to payment in a foreclosure only after the first mortgage is paid.", "swing loan": "See: Bridge loan", "term": "The number of years it will take to pay off a loan. The loan term is used to determine the payment amount, repayment schedule and total interest paid over the life of the loan.", "third party fees": "Fees charged for services rendered by parties other than the borrower or the lender. Such fees may include appraisal, credit report, title and flood certifications.", "title": "Written evidence of ownership in property.", "title company": "The agency that will investigate a property’s title (or deed) for discrepancies or undiscovered liens and that will issue title insurance to the lender after the title is deemed clear.", "title insurance": "Insurance that protects an interested party, either the owner or the lender, against issues that would affect legal ownership of the property.", "title search": "An examination of records used to determine the legal ownership of property and all liens and encumbrances on it. Usually performed by a title company or attorney.", "total expense ratio": "See: Debt-to-income ratio", "transaction fee": "The fee that may be charged each time you draw on your credit line.", "treasury index": "An index that is used to determine interest rate changes for certain adjustable-rate mortgage (ARM) plans. It is based on the results of auctions that the U.S. Treasury holds for its Treasury bills and securities or is derived from the U.S. Treasury’s daily yield curve, which is based on the closing market bid yields on actively traded Treasury securities in the over-the-counter market. See also: Prime rate", "trustee": "A fiduciary that holds or controls property for the benefit of another.", "truth in lending act": "A federal law requiring disclosure of credit terms using a standard format. This is intended to facilitate comparisons between the lending terms of different financial institutions. Read about the Truth in Lending Act on the Dept. of the Treasury website layer", "unapplied funds": "When your entire payment or a portion of your payment received by Bank of America may be placed into a Suspense account.", "underwriter": "The person who approves or denies a home loan, based on the lender’s underwriting and approval criteria.", "underwriting": "The lender’s process of deciding whether to make a loan to a potential borrower based on credit, employment, assets and other factors, and the matching of this risk to an appropriate rate, term and loan amount.", "uniform residential loan application  1003 ": "The standard loan application form published by the Federal National Mortgage Association (Fannie Mae) and used by most lenders.", "unpaid principal balance": "When we use the term Unpaid Principal Balance, we mean the amount you borrowed (which may include amounts that have been added to your principal balance in connection with loan modifications) over the history of the loan that has not yet been paid back. We may charge you interest each month on the Unpaid Principal Balance (or amount owed), according to the terms of your loan.", "unsecured lines of credit": "Typically used when referring to a loan or a line of credit (unsecured loan, unsecured line of credit) that is not backed by collateral.", "unsecured loan": "Typically used when referring to a loan or a line of credit (unsecured loan, unsecured line of credit) that is not backed by collateral.", "upfront costs": "The costs you must pay when applying for a loan. Typically these include loan application fees. Some lenders require some of your closing costs also be paid when you apply.", "va loan": "A mortgage that is guaranteed by the Department of Veterans Affairs (VA) for qualified veterans of U.S. military forces. See also: Government loan", "vacation home": "A vacation home is a single-family property that the borrower occupies in addition to his or her primary residence. The property cannot be considered income-producing and must not be part of a mandatory rental pool, but occasionally may be rented to friends and relatives. When property is classified as a second home, rental income may not be used to qualify the applicant. A 2- to 4-unit property is not eligible for second home status. Also known as second home.", "variable rate": "An interest rate that may fluctuate or change periodically, often in relation to an index such as the prime rate or other criteria. Payments may increase or decrease accordingly.", "variable rate monthly minimum payment": "The minimum amount you will need to pay each month on your home equity line of credit, or HELOC (does not include any payments for the Fixed- Rate Loan Payment Option). The payment amount includes both principal and interest (minimum of $100). The monthly required payment may vary each month and is based on your outstanding loan balance and fluctuating interest rate. In general, this payment is intended to repay your loan balance in substantially equal principal and interest installments over the remaining loan term, based on the balance and rate information at the time of each monthly calculation.", "w 2": "A wage and tax statement provided by your employer annually. The W-2 form details your income and the various local and federal taxes withheld from your income. It is provided to the IRS along with your tax return.", "walk through": "A final inspection shortly before settlement to make sure the property is in the same condition that it was at the time the offer contract was written.", "what if analysis": "An affordability analysis that is based on a what-if scenario. A what-if analysis is useful if you do not have complete data or if you want to explore the effect of various changes to your income, liabilities, or available funds or to the qualifying ratios or down payment expenses that are used in the analysis.", "where is this found ": "Your application number is listed in your Welcome Letter or other bank communications regarding this application. If you haven’t received your Welcome Letter or need help with your application number, please call 1.800.269.3084.", "why do we ask for this ": "When you create online credentials, we take extensive precautions to protect your information and verify your identity. Your Social Security number allows us to confirm your identity.", "windstorm insurance": "This coverage is typically required in coastal areas and pays for property damage resulting from a windstorm. Like flood and earthquake coverage, windstorm insurance covers damage to the dwelling and, in some cases, personal property and living expenses if the dwelling is uninhabitable. Some states offer market assistance programs or joint underwriting associations to help homeowners find coverage in areas where coverage is scarce.", "wire transfer": "A transfer of money from one person’s bank to another person’s bank account, either domestically or internationally.", "year end statement": "The report shows how much was paid in interest during the year, as well as the remaining mortgage loan balance at the end of the year. If the bank has an impound account for you, it will also show how much was paid and reserved in property taxes. If the bank does not have a property tax impound account, then tax details are not displayed on the report."}